# Цель: Написать программу на языке Python, используя Pycharm, для демонстрации динамической типизации.

name = 'Светлана'
print('Имя: ', name)

age = 31
print('Возраст: ', age)

age = age + 2
print('Возраст через 2 года: ', age)

is_student = True
print('Является студентом: ', is_student)