example = 'В твоих руках любых достичь вершин'

# 1) Первый символ строки
print(example[0])

# 2) Последний символ строки
print(example[-1])

# 3) Вторая половина строки, нечётное кол-во символов

# здесь нужно if для проверки на чёт/нечёт, но, раз ТЗ сформировано на основе пройденного материала, примем как известную величину то, что середина строки равна 17

print(example[17:34])

# 4) Вывод на экран строки в обратном порядке

print(example[::-1])

# 5) Вывод каждого второго символа строки

print(example[0:34:2])